Repository: adityaphatak/Inputability
Catalog: po/*.po
Languages: gd

source: _Show Onboard
gd: _Seall Onboard

source: _Hide Onboard
gd: _Falaich Onboard

source: Onboard on-screen keyboard
gd: Meur-chlàr Onboard air-sgrìn

source: Layout file ({}) or name
gd: Faidhle co-dhealbhachadh ({}) no ainm

source: Theme file (.theme) or name
gd: Faidhle thèama (.theme) no ainm

source: Window x position
gd: Suidheachaidh x na h-uinneag

source: Window y position
gd: Suidheachaidh y na h-uinneag

source: Window size, widthxheight
gd: Meud uinneag, leudxàirde

source: Start in XEmbed mode, e.g. for gnome-screensaver
gd: Tòisich ann am modh Xembed. e.g. Son sàbhalaiche-sgrìn-gnome

source: Keep aspect ratio when resizing the window
gd: Glèidh co-mheas deilbh nuair ath-mheudachadh an uinneag

source: Allow multiple Onboard instances
gd: Ceadaich iomadach eisimpleirean Onboard

source: Override auto-detection and manually select quirks QUIRKS={metacity|compiz|mutter}
gd: Tar-àithne fèin-lorgaidh agus tagh quirks a làimh QUIRKS={metacity|compiz|mutter}

source: Migrating user directory '{}' to '{}'.
gd: A siùbhlach eòlaire a' chleachdaiche'{}' gu '{}'.

source: Failed to migrate user directory.
gd: D'fhàilig a shiùbhlaich eòlaire a' chleachdaiche.

source: layout '{filename}' does not exist
gd: Co-dhealbhadh '{filename}' neo-bhitheachd

source: theme '{filename}' does not exist
gd: tèama '{filename}' neo-bhitheachd

source: Loading theme from '{}'
gd: Luchdadh tèama bhon '{}'

source: Unable to read theme '{}'
gd: Neo-comasach leughadh tèama '{}'

source: Enabling auto-show requires Gnome Accessibility. Onboard can turn on accessiblity now, however it is recommended that you log out and back in for it to reach its full potential. Enable accessibility now?
gd: Tha a' cur an comas sealladh-fèin-obrachail ag Gnome Accessibility (ruigsinneachd). Dh'fhaodaidh Onboard tionndaidh air ruigsinneachd an dràsta, ach tha air mholadh dhut logadh a-mach 's a-steach air ais gu ruige làn-chomas. Cuir an comas ruigsinneachd an dràsta?

source: color scheme '{filename}' does not exist
gd: sgeama dath '{filename}' neo-bhitheachd

source: Onboard Settings
gd: Suidheachaidhean Onboard

source: Onboard onscreen keyboard settings
gd: Suidheachaidhean meur-chlàr Onboard air sgrìn

source: Change Onboard settings
gd: Atharraich suidheachaidhean Onboard

source: Onboard is configured to appear with the dialog to unlock the screen; for example to dismiss the password-protected screensaver. However the system is not configured anymore to use Onboard to unlock the screen. A possible reason can be that another application configured the system to use something else. Would you like to reconfigure the system to show Onboard when unlocking the screen?
gd: Tha Onboard air rèiteachadh gus an nochdadh leis an co-labhairt son fosgladh an sgrìn: mar eisimpleir gus a chur sàbhalaiche-sgrìn facal-faire-dìonadach à dreuchd. Co-dhiù chan eil an t-siostam ga rèiteachadh tuilleadh son cleachdadh Onboard nuair fosgladh an sgrìn. 'S mathaid an adhbhar gu bheil prògram eile a rèiteachadh an t-siostam ri cleachdadh rudeigin eile. Am bu chaomh leat ath-rèitich an t-siostam gus a nochd Onboard nuair fosgladh an sgrìn?

source: Onboard is configured to appear with the dialog to unlock the screen; for example to dismiss the password-protected screensaver. However this function is disabled in the system. Would you like to activate it?
gd: Tha Onboard air rèiteachadh gus nochdadh leis a co-labhairt son fosgladh an sgrìn; mar eisimpleir gus a chur an t-sàbhalaiche-sgrìn facal-faire dìonadach à dreuchd. Co dhiù chaidh am foincsean seo chur à comas anns an t-siostam. Am bu chaomh leat a chur thuige?

source: Atspi unavailable, auto-hide won't be available
gd: Atspi neo-tharbhach, cha bhith fèin-fàlaich ri fhaighinn

source: New Input Device
gd: Innleachd Ion-chur Ùr

source: Onboard has detected a new input device
gd: Lorg Onboard innleachd ion-chur ùr

source: Do you want to use this device for keyboard scanning?
gd: Bheil thu ag iarraidh cleachdadh an innleachd seo son sganadh meur-chlàr?

source: Use device
gd: Cleachd innleachd

source: Failed to execute '{}', {}
gd: D'fhàilig a thoirt gu buil '{}', {}

source: no window transparency available; screen doesn't support alpha channels
gd: chan eil trìd-shoillse na h-uinneagan ri làimh. Chan eil an sgrìn toirt taic do seanailean alpha

source: Scanner Settings
gd: Suidheachaidhean Sganair

source: Select a scanning _profile:
gd: Tagh _proifil sgànadh:

source: _Step interval:
gd: Eadar-ùine _ceum:

source: Sc_an cycles:
gd: Cuairtean Sgànadh:

source: The time the scanner rests on a key or group before moving to the next. (in seconds)
gd: An ùine th' an sganair aig fois air putan no buidheann os cionn a' gluasad gus an ath. (ann an diogan)

source: The number of times the scanner cycles through the entire keyboard before it stops.
gd: An uibhir amannan tha an sganair cuairteachadh tro a' mheur-chlàr gu lèir os chionn dha stad.

source: Step _only during switch down
gd: Ceum _a-mhàin fad tionndaidh sìos

source: Progress the highlight only while the switch is held down.
gd: Adhartaich an sàr-roghainn a-mhàin nuair tha an suidse a chumail sìos.

source: _Forward interval:
gd: _Eadar-ùine air adhart:

source: _Backtrack interval:
gd: _Eadar-ùine air ais:

source: The time the scanner rests on a key while progressing forward. (in seconds)
gd: An ùine tha an sganair aig fois air putan nuair ag adhartachadh air adhart. (ann an dìogan)

source: The time the scanner rests on a key while moving backwards. (in seconds)
gd: An ùine tha an sganair aig fois air putan nuair gluasad air ais. (ann an dìogan)

source: Backtrack _steps:
gd: _Ceuman air ais:

source: The number of keys the scanner steps back before moving forward again.
gd: An uibhir de phutain tha an sganair ceumnach air ais os chionn gluasad air adhart a-rithist.

source: _Alternate switch actions
gd: Gnìomhan suidse _eile

source: Swap the scan actions after every key activation. The Step action will become the Activate action and vice versa.
gd: Suaip gnìomhan an sganair às dèidh h-uile cur thuige phutan. Thig an gnìomh ceum na gnìomh cuir thuige agus cùlaibh air beulaibh.

source: Profiles
gd: Pròifilean

source: _Select an input device:
gd: _Tagh an innleachd ion-chur:

source: _Use this device only for scanning
gd: _Cleachd an innleachd seo a-mhàin son sganadh

source: The selected device should not control the system mouse cursor or the keyboard caret.
gd: Cha bu choir an innleachd taghte thoirt smachd air an t-siostam cùrsair luch no easbhaidh meur-chlàr.

source: Input Device
gd: Innleachd Ion-chur

source: Automatic scan for 1 switch
gd: Sgan gu fèin-obrachail son 1 suidse

source: Critical overscan for 1 switch
gd: Sgan-thairis riatanach son 1 suidse

source: Step scan for 2 switches
gd: Sgan ceum son 2 suidse

source: Directed scan for 3 or 5 switches
gd: Sgan stiùirichte son 3 no 5 suidsichean

source: Ignoring key '{}'. No svg filename defined.
gd: Leigeil seachad iuchair '{}'. Cha deach ainm-faidhle svg a shònrachadh.

source: Ignoring key '{}'. Not found in '{}'.
gd: Leigeil seachad iuchair '{}'. Gun lorg ann an '{}'.

source: , unassigned
gd: , neo-iomruinte

source: Error loading
gd: Mearachd luchdadh

source: copying layout '{}' to '{}'
gd: copaigeadh co-dhealbhachd '{}' gu '{}'

source: copy_layouts failed, unsupported layout format '{}'.
gd: D'fhàilig copaidh_cho-dhealbhachdan, fòrmat co-dhealbhachd gun taic '{}'.

source: copying svg file '{}' to '{}'
gd: copaigeadh faidhle svg '{}' gu '{}'

source: Color scheme for theme '{filename}' not found
gd: Gun lorg sgeama dath son tèama '{filename}'

source: Error loading theme '{filename}'. {exception}: {cause}
gd: Mearachd luchdadh tèama '{filename}'. {exception}: {cause}

source: Error saving
gd: Mearachd sàbhaladh

source: Loading legacy color scheme format '{old_format}', please consider upgrading to current format '{new_format}': '{filename}'
gd: Luchdadh fòrmat sgeama dath dhìleab '{old_format}', Meomhraich sibh leasachadh dhan fòrmat cuartach '{new_format}': '{filename}'

source: Error loading color scheme '{filename}'. {exception}: {cause}
gd: Mearachd luchdadh sgeama dath '{filename}'. {exception}: {cause}

source: Duplicate key_id '{}' found in color scheme file. Key_ids must occur only once.
gd: Dèan lethbhreac key_id '{}' air lorg sam faidhle sgeama dath. Feumaidh key_id a' tachairt dìreach aon turas a-mhàin.

source: Settings
gd: Suidheachaidhean

source: New snippet
gd: Snippet ùr

source: _Save snippet
gd: _Sàbhail snippet

source: Enter a new snippet for this button:
gd: Cuir a-steach snippet ùr son a' phutan seo:

source: _Button label:
gd: Ainmich _Putan:

source: S_nippet:
gd: C_riomag:

source: Onboard Preferences
gd: Roghainnean Onboard

source: No file manager to open layout folder
gd: Às aonais manaidsear faidhle son fosgladh pasgan co-dhealbhachd

source: Enter name for personalised layout
gd: Cuir a-steach ainm son pearsanachadh co-dhealbhachd

source: System settings not found ({}): {}
gd: Suidheachaidhean siostam gun lorg ({}): {}

source: None
gd: Neoni

source: Corners only
gd: Oisean a-mhàin

source: All corners and edges
gd: Na h-uile oiseanan agus oirean

source: Add Layout
gd: Cuir Ris Co-dhealbhachd

source: Onboard layout files
gd: Faidhlichean co-dhealbhachd Onboard

source: All files
gd: Na h-uile faidhlichean

source: Enter a name for the new theme:
gd: Inntrig ainm son an tèama ùr:

source: This theme file already exists. '{filename}' Overwrite it?
gd: Tha faidhle tèama seo ann mar thà. '{filename}' Tar-sgrìobh e?

source: Reset selected theme to Onboard defaults?
gd: Ath-shuidhich an tèama taghte gu bunaitean Onboard ?

source: Delete selected theme?
gd: Dubh às an tèama taghte?

source: Reset
gd: Ath-shuidhich

source: Flat
gd: Còmhnard

source: Gradient
gd: Caisead

source: Dish
gd: Soitheach

source: Default
gd: Bunaiteach

source: Bold
gd: Clò trom

source: Italic
gd: Clò Eadailteach

source: Condensed
gd: Teannaichte

source: Step
gd: Ceum

source: Left
gd: Clì

source: Right
gd: Deas

source: Up
gd: Suas

source: Down
gd: Sìos

source: Activate
gd: Gnìomhaich

source: Action:
gd: Gnìomh:

source: Disabled
gd: A chur à comas

source: Button
gd: Putan

source: Press a button...
gd: Brùth putan...

source: Press a key...
gd: Brùth putan...

source: Activate Hover Click
gd: Cuir thuige Briog Fan-os-cionn

source: Alphanumeric keys
gd: Putain litir-àireamhail

source: Double click
gd: Briog dùbailte

source: Drag click
gd: Briog slaod

source: End
gd: Crìoch

source: Function keys
gd: Putain foincsean

source: Number block and function keys
gd: Bloca àireamh agus putain foincsean

source: Hide Onboard
gd: Falaich Onboard

source: Main keyboard
gd: Prìomh meur-chlàr

source: Menu
gd: Clàr-iùil

source: Middle click
gd: Briog meadhan

source: Move Onboard
gd: Gluais Onboard

source: Number block and snippets
gd: Bloca àireamh agus snippets

source: Pause
gd: Stad

source: Preferences
gd: Roghainnean

source: Quit
gd: Fàg

source: Return
gd: Air ais

source: Right click
gd: Briog deas

source: Scroll
gd: Sgrola

source: Space
gd: Spàs

source: Toggle click helpers
gd: Toglaich cuidichean briog

source: Tab
gd: Taba

source: gsettings schema for '{}' is not installed
gd: chan eil schema gsettings son '{}' stàlaichte

source: {description} '{filename}' not found yet, retrying in default paths
gd: {description} '{filename}' gun lorg fhathast, feuchainn a-rithist ann an slighean bunaiteach

source: unable to locate '{filename}', loading default {description} instead
gd: neo-chomasach lorg '{filename}', luchdachadh {description} bunaiteach na àite

source: failed to find {description} '{filename}'
gd: D'fhàilig lorg {description} '{filename}'

source: {description} '{filepath}' found.
gd: {description} '{filepath}' air lorg.

source: Looking for system defaults in {paths}
gd: Sealltain son bunaitean an t-siostam ann an {paths}

source: Failed to read system defaults.
gd: D'fhàilig leughadh bunaitean an t-siostam.

source: No system defaults found.
gd: Gun lorg bunaitean an t-siostam

source: Loading system defaults from {filename}
gd: Luchdadh bunaitean an t-siostam bhon {filename}

source: Found system default '[{}] {}={}'
gd: Air lorg siostam bunaiteach '[{}] {}={}'

source: System defaults: Unknown key '{}' in section '{}'
gd: Bunaitean an t-siostam: Iuchair neo-aithnichte '{}' ann an roinn '{}'

source: System defaults: Invalid value for key '{}' in section '{}' {}
gd: Bunaitean an t-siostam: luach mi-dhligheach son iuchair '{}' ann an roinn '{}' {}

source: Failed to get gsettings value.
gd: D'fhàilig fhaighinn luach gsettings.

source: Customize Theme
gd: Gnàthaich Tèama

source: Color Sche_me
gd: Sgea_ma Dath

source: _Background:
gd: _Cùl-raon

source: _Angle:
gd: _Ceàrn:

source: Light Direction
gd: Cùrsa na solas

source: Keyboard
gd: Meur-chlàr

source: _Style:
gd: _Stoidhle

source: R_oundness:
gd: C_ruinnead:

source: S_ize:
gd: M_eud:

source: Key Style
gd: Stoidhle Putain

source: _Key:
gd: _Putan:

source: _Border:
gd: _Oir:

source: Gradients
gd: Caiseadan

source: _Strength:
gd: _Neart:

source: Shadow
gd: Sgàil

source: Keys
gd: Putain

source: _Font:
gd: _Cruth-clò:

source: _Attributes:
gd: _Buadhan

source: Font
gd: Cruth-clò

source: I_ndependent size
gd: Meud N_eo-eisimeileach

source: _Super key:
gd: Putan _Super:

source: Label Override
gd: Tar-àithne Bileag

source: Labels
gd: lipeagan

source: General
gd: Coitcheann

source: Window
gd: Uinneag

source: Layout
gd: Co-dhealbhachd

source: Theme
gd: Tèama

source: Universal Access
gd: Cothrom Uileach

source: _Auto-show when editing text
gd: _Sealladh-fèin-obrachail nuair fàgail teacsa

source: Show Onboard when there is a recognized text window in focus. Requires Gnome Accessibility.
gd: Seall Onboard nuair tha uinneag teacsa aithnichte ann am fòcas. Ag Iarraidh Gnome Accessibility (ruigsinneachd).

source: Start Onboard _hidden
gd: Tòisich Onboard _falaichte

source: Start Onboard hidden.
gd: Tòisich Onboard Falaichte.

source: Show floating _icon when Onboard is hidden
gd: Seall _ìomhaigheag air bhog nuair tha Onboard falaichte

source: Show a floating icon on the desktop when Onboard is hidden. A click on the icon makes Onboard reappear.
gd: Seall ìomhaigheag air bhog air a' bhàrr-deasc nuair tha Onboard falaichte. Le briog air an ìomhaigheag nochdadh Onboard a-rithist.

source: Show/Hide Options
gd: Seall/Falaich Roghainnean

source: _Show status icon
gd: _Seall ìomhaigheag inbhe

source: Show the status item. A click on that icon hides or shows Onboard.
gd: Seall inbhe -an nì. Tha briog air an ìomhaigheag sin a' falach no a' sealltainn Onboard.

source: Show when _unlocking the screen
gd: Seall nuair a' _fosgail a sgrìn

source: Show Onboard when the dialog to unlock the screen appears; this way Onboard can be used for example to enter the password to dismiss the screensaver when it is set to ask for it.
gd: Seall Onboard nuair tha co-labhairt son fosgail an sgrìn a nochdadh: An dhòigh seo faodaidh Onboard chleachdadh mar eisimpleir son cuir a-steach facal-faire no cuir air falbh an sàbhalaiche-sgrìn nuair tha e stèidhichte mar iarrtas.

source: Show _tooltips
gd: Seall _gliocasan-inneal

source: Show tooltips for the keyboard&apos;s buttons.
gd: Seall gliocasan-inneal son na putain meur-chlàr.

source: Show tooltips for the keyboard's buttons.
gd: Seall gliocasan-inneal na putain a' mheur-chlàr.

source: Desktop Integration
gd: Innteagrachadh a' bhàrr-deasc

source: Show window _decoration
gd: Seall uinneag _sgeadachadh

source: Show window caption and frame.
gd: Seall an uinneag caipsean agus frèam.

source: Show always on visible _workspace
gd: Seall an còmhnaidh air _rùm-obrach lèirsinneach

source: &quot;Sticky&quot; mode for keyboard and floating icon.
gd: &quot;Sticky&quot; modh son meur-chlàr agus ìomhaigheag air bhog.

source: "Sticky" mode for keyboard and floating icon.
gd: "Sticky" modh son meur-chlàr agus ìomhaigheag air bhog.

source: _Force window to top
gd: _Co-èiginn an uinneag don mhullach

source: Try harder to keep Onboard above anything on-screen.
gd: Feuch nas cruaidh ri glèidheadh Onboard os cheann rud sam bith air-sgrìn.

source: Keep _aspect ratio
gd: Glèidh _co-mheas deilbh

source: Constrain window size to the layout's aspect ratio.
gd: Co-èiginn meud uinneag gu co-mheas deilbh a' cho-dhealbhadh.

source: Window Options
gd: Roghainnean Uinneag

source: _Frame resize handles:
gd: Làmhrachain Ath-mheudachd _Frèam:

source: Resize Protection
gd: Dìon Ath-mheudachd

source: Wind_ow:
gd: Uinn_eag

source: Transparency of the whole keyboard window. Requires compositing.
gd: Trìd-shoillse den uinneag meur-chlàr slàn. Ag iarraidh co-dhèantachd.

source: Transparency of the keyboard background
gd: Trìd-shoillse den chùl-raon a' mheur-chlàr

source: _No background
gd: _Gun chùl-raon

source: Show the desktop through the gaps between keys.
gd: Seall a' bhàrr-deasc tro na beàrnan eadar na putain.

source: Transparency
gd: Trìd-shoillsean

source: Set _transparency to
gd: Stèidhich _trìd-shoillse gu

source: Enable inactive transparency. Requires compositing.
gd: Cuir an comas trìd-shoillse neo-ghnìomhach. Ag iarraidh co-dhèantachd.

source: Transparency when the pointer leaves the keyboard. Requires compositing.
gd: Trìd-shoillse nuair tha an tomhaire a' fàgail a' mheur-chlàr. Ag iarraidh co-dhèantachd.

source: after
gd: As dhèidh

source: Delay in seconds until the inactive transparency takes effect.
gd: Dàil ann an dìogan gus an toir an trìd-shoillse neo-ghnìomhach buaidh.

source: seconds
gd: diogan

source: When Inactive
gd: Nuair Neo-ghnìomhach

source: _Personalize
gd: _Pearsanaich

source: _Open layouts folder
gd: _Fosgail Pasgan Co-dhealbhachdan

source: C_ustomize theme
gd: G_nàthachadh tèama

source: Follow _system theme
gd: Lean an tèama _sìostam

source: Remember what Onboard theme was last used for every system theme.
gd: Cuimhnich dè tèama chleachd Onboard mu dheireadh son gach tèama siostam.

source: Snippets are pieces of text which are entered when the corresponding button in Onboard is pressed.
gd: Snippets seo pìosan teacsa a chur a-steach nuair thig am putan co-fhreagarrach ann an Onboard a' bhrùthadh.

source: Hide the system-provided hover click window while Onboard is running.
gd: Falaich an uinneag briog fan-os-cionn siostam-sholaraichte nuair a ruith Onboard.

source: Always enable the system-provided hover click window when exiting Onboard.
gd: An còmhnaidh cuir an comas an uinneag briog fan-os-cionn siostam-sholaraichte nuair fàgail Onboard.

source: Hover Click
gd: Briogadh Fan Os Cionn

source: Enable keyboard _scanning
gd: Cuir an comas _sgànadh a' mheur-chlàr

source: Sc_anner Settings
gd: Suidheachaidhean Sg_ànair

source: Keyboard Scanning
gd: Sgànadh a' mheur-chlàr

source: Onboard onscreen keyboard
gd: Meur-chlàr Onboard air-sgrìn

source: Flexible onscreen keyboard for GNOME
gd: Meur-chlàr air-sgrìn sùbailte son GNOME

source: Button Number
gd: Àireamh Putan

source: Button Label
gd: Lipeag Putan

source: Snippet Text
gd: Criomag Teacsa

source: Must be an integer number
gd: Feumaidh bhith na àireamh shlàn

source: Snippet %d is already in use.
gd: Tha snippet %d na chleachd mar thà.
